SOAAssignment11/SOAPMessages.txt

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password>12</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>email or password wrong</faultstring><detail/></soap:Fault></soap:Body></soap:Envelope>
